# <!-- -->
# //  /**/
# 单行注释
"""
多行注释
"""
'''
多行注释
'''

# 输入输出工具
# input(提示信息)
#
# js var aa = "asdf"
# name = input("请输入你的名字：")

# 输出工具
# print()
# 可以跟多个参数,可以传递 变量 数据 表达式
# print(name)
# print("周润发","周润发",123,123+456)

# 变量： 可改变的数据
# 语法
"""
变量名 = 值
# 链式赋值
变量名1=变量名2=10
# 多元赋值
变量1,变量2,变量3,变量4=1,2,3,4

js
变量1=值1,变量2=值2,变量3=值3
"""
# num1 =10
# num2=num3=20
# print(num1,num2,num3)
# num1,num2,num3=10,20,30
# print(num1,num2,num3)

# 数据类型
# 数字类型
# num = 2 #
# num1 = 10 #  8 4 2 1
# 整型 浮点型
# 00000000
# 10 20 0 -20   1.2 1.3 1.0
# 科学计数法
# 1e4
# 二进制0b 八进制0o 十进制 十六进制0x
# 10 1010


# 字符串类型
# 字符编码
# ASCII GBK GB2312 UTF-8 unicode
# 定义字符串
# js '' ""  ``
# python ''  ""  """"""  ''' '''
# str1 = "山西" \
#        "优逸客"
# str2 = '陕西优逸客'
# str3 = """优斯特"""
# str4 = '''山西硬汉'''
#
# str5 = " I'm "
# str5 = """
# asdf
# aasdf
# asdf
# asd
# f
# """
# 转义字符
str1 = " \" \"\" "
str2 = '\''
str3 = "\\abc"
"""
\\
\'
\"
\n 换行
\r 回车
\t 制表符
"""
# 字符前缀
# r取消转义作用
print(r"a\nb")


